posts/install-mariadb/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_tw">
<head>
<meta charset="utf-8">
<meta name="description" content="install mariadb on archlinux">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Install Mariadb | Simple Life</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://mariolong.github.io/posts/install-mariadb/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Mario Long">
<link rel="prev" href="../using-dired/" title="Using dired in Emacs" type="text/html">
<link rel="next" href="../using-mariadb/" title="Using Mariadb" type="text/html">
<meta property="og:site_name" content="Simple Life">
<meta property="og:title" content="Install Mariadb">
<meta property="og:url" content="https://mariolong.github.io/posts/install-mariadb/">
<meta property="og:description" content="install mariadb on archlinux">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-06-15T16:20:11+08:00">
<meta property="article:tag" content="archlinux">
<meta property="article:tag" content="mariadb">
<meta property="article:tag" content="mysql">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">略過主內容</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://mariolong.github.io/">

            <span id="blog-title">Simple Life</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav"></ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../categories/cat_computer/" class="nav-link">電腦</a>
                </li>
<li class="nav-item">
<a href="../../categories/cat_investment/" class="nav-link">投資</a>
                </li>
<li class="nav-item">
<a href="../../categories/cat_life/" class="nav-link">生活</a>
                </li>
<li class="nav-item">
<a href="../../archive.html" class="nav-link">歸檔</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">訂閱</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">

        <!--Body content-->
        
		<div class="yue">
			
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Install Mariadb</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Mario Long
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2018-06-15T16:20:11+08:00" itemprop="datePublished" title="2018-06-15 16:20">2018-06-15 16:20</time></a>
            </p>
                <p class="commentline">
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/install-mariadb.html">Comments</a>


            

        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Ref: <a href="https://wiki.archlinux.org/index.php/MySQL">MySQL - ArchWiki</a>
</p>

<div id="outline-container-orge86c481" class="outline-2">
<h2 id="orge86c481">install mariadb</h2>
<div class="outline-text-2" id="text-orge86c481">
<div class="highlight"><pre><span></span>yaourt -S mariadb
</pre></div>
</div>
</div>

<div id="outline-container-orga9f1fc1" class="outline-2">
<h2 id="orga9f1fc1">install and setup database</h2>
<div class="outline-text-2" id="text-orga9f1fc1">
<div class="highlight"><pre><span></span>sudo mysql_install_db --user<span class="o">=</span>mysql --basedir<span class="o">=</span>/usr --datadir<span class="o">=</span>/var/lib/mysql
</pre></div>
</div>

<div id="outline-container-orge54df1b" class="outline-3">
<h3 id="orge54df1b">message</h3>
<div class="outline-text-3" id="text-orge54df1b">
<pre class="example">
PLEASE REMEMBER TO SET A PASSWORD FOR THE MariaDB root USER !
To do so, start the server, then issue the following commands:

'/usr/bin/mysqladmin' -u root password 'new-password'
'/usr/bin/mysqladmin' -u root -h arch64 password 'new-password'

Alternatively you can run:

'/usr/bin/mysql_secure_installation'
^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

which will also give you the option of removing the test
databases and anonymous user created by default.  This is
strongly recommended for production servers.

See the MariaDB Knowledgebase at http://mariadb.com/kb or the
MySQL manual for more instructions.

You can start the MariaDB daemon with:
cd '/usr' ; /usr/bin/mysqld_safe --datadir='/mnt/lvm-data/mysql-data'

You can test the MariaDB daemon with mysql-test-run.pl
cd '/usr/mysql-test' ; perl mysql-test-run.pl

Please report any problems at http://mariadb.org/jira

The latest information about MariaDB is available at http://mariadb.org/.
You can find additional information about the MySQL part at:
http://dev.mysql.com
Consider joining MariaDB's strong and vibrant community:
https://mariadb.org/get-involved/
</pre>
</div>
</div>
</div>

<div id="outline-container-org418ba80" class="outline-2">
<h2 id="org418ba80">edit <code>/etc/mysql/my.cnf</code>
</h2>
<div class="outline-text-2" id="text-org418ba80">
<p>
Tip: If you use something different from /var/lib/mysql for your data
dir, you need to set <code>datadir=&lt;YOUR_DATADIR&gt;</code> under section <code>[mysqld]</code> of
your <code>/etc/mysql/my.cnf</code>.  The following command will interactively
guide you through a number of recommended security measures at the
database level:
</p>
</div>
</div>

<div id="outline-container-org7f205df" class="outline-2">
<h2 id="org7f205df">start/enable <code>mariadb.service</code> with systemd</h2>
<div class="outline-text-2" id="text-org7f205df">
<div class="highlight"><pre><span></span>sudo systemctl start mariadb
</pre></div>
</div>
</div>

<div id="outline-container-org3702a00" class="outline-2">
<h2 id="org3702a00">To start mysqld at boot time</h2>
<div class="outline-text-2" id="text-org3702a00">
<p>
you have to copy support-files/mysql.server to the right place for your system
</p>

<div class="highlight"><pre><span></span>sudo mysql_secure_installation
</pre></div>

<p>
which will also give you the option of removing the test
databases and anonymous user created by default.  This is
strongly recommended for production servers.
</p>
</div>
</div>

<div id="outline-container-org3ea20e5" class="outline-2">
<h2 id="org3ea20e5">Using UTF8MB4</h2>
<div class="outline-text-2" id="text-org3ea20e5">
<p>
在 <code>/etc/mysql/my.cnf</code> 加上以下指令：
</p>

<div class="highlight"><pre><span></span>[client]
default-character-set = utf8mb4

[mysqld]
collation_server = utf8mb4_unicode_ci
character_set_server = utf8mb4

[mysql]
default-character-set = utf8mb4
</pre></div>
</div>
</div>

<div id="outline-container-org07ca960" class="outline-2">
<h2 id="org07ca960">開啓自動補全</h2>
<div class="outline-text-2" id="text-org07ca960">
<p>
Note: Enabling this feature can make the client initialization longer.
</p>

<p>
The MySQL client completion feature is disabled by default. To enable
it system-wide edit <code>/etc/mysql/my.cnf</code> , and replace <code>no-auto-rehash</code> by
<code>auto-rehash</code>. Completion will be enabled next time you run the MySQL
client.</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/archlinux/" rel="tag">archlinux</a></li>
            <li><a class="tag p-category" href="../../categories/mariadb/" rel="tag">mariadb</a></li>
            <li><a class="tag p-category" href="../../categories/mysql/" rel="tag">mysql</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../using-dired/" rel="prev" title="Using dired in Emacs">上一篇</a>
            </li>
            <li class="next">
                <a href="../using-mariadb/" rel="next" title="Using Mariadb">下一篇</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>迴響</h2>
        
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="simple-life",
            disqus_url="https://mariolong.github.io/posts/install-mariadb/",
        disqus_title="Install Mariadb",
        disqus_identifier="cache/posts/install-mariadb.html",
        disqus_config = function () {
            this.language = "zh_tw";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="simple-life";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
		<!--End of body content-->


		<footer id="footer">
			Contents © 2018         <a href="mailto:mariolong5782@gmail.com">Mario Long</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
			
		</footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("zh-tw");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
